#### ✅ Terraform Format and Style 🖌
#### ✅ Terraform Initialization ⚙️
#### ✅ Terraform Validation 🤖
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### ✅ Terraform Plan 📖

<details><summary>Show Plan</summary>

```
random_password.certificate-password: Refreshing state... [id=none]
tls_private_key.private_key: Refreshing state... [id=e02215b4a26f6411d46c394957a920ba15244fd6]
acme_certificate.certificate: Refreshing state... [id=718bdd2a-022e-6821-d906-d58d75aff882]
acme_registration.reg: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/acct/1611596407]
azurerm_container_app_environment_certificate.container-app-certificate: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/managedEnvironments/log-otter-sample-container-app-environment/certificates/wildcard-certificate]
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter]
azurerm_dns_zone.sample-domain: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.Network/dnsZones/sample.logotter.co.uk]
azurerm_log_analytics_workspace.log-analytics-workspace: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.OperationalInsights/workspaces/log-otter-log-analytics-workspace]
azurerm_cosmosdb_account.db: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.DocumentDB/databaseAccounts/log-otter-samples]
azurerm_container_app_environment.container-app-environment: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/managedEnvironments/log-otter-sample-container-app-environment]
azurerm_application_insights.app-insights: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.Insights/components/log-otter-app-insights]
azurerm_dns_a_record.admin: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.Network/dnsZones/sample.logotter.co.uk/A/admin]
azurerm_dns_a_record.api: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.Network/dnsZones/sample.logotter.co.uk/A/api]
azurerm_dns_a_record.root: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.Network/dnsZones/sample.logotter.co.uk/A/@]
azurerm_container_app.ingress: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/ingress]
azurerm_container_app.customer-worker: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/customer-worker]
azurerm_container_app.hub: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/hub]
azurerm_container_app.customer-api: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/customer-api]
azurerm_container_app_custom_domain.admin: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/ingress/customDomainName/admin.sample.logotter.co.uk.]
azurerm_dns_txt_record.root: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.Network/dnsZones/sample.logotter.co.uk/TXT/asuid]
azurerm_container_app_custom_domain.root: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/ingress/customDomainName/sample.logotter.co.uk.]
azurerm_container_app_custom_domain.api: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/ingress/customDomainName/api.sample.logotter.co.uk.]
azurerm_dns_txt_record.api: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.Network/dnsZones/sample.logotter.co.uk/TXT/asuid.api]
azurerm_dns_txt_record.admin: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.Network/dnsZones/sample.logotter.co.uk/TXT/asuid.admin]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # acme_certificate.admin will be created
  + resource "acme_certificate" "admin" {
      + account_key_pem               = (sensitive value)
      + cert_timeout                  = 30
      + certificate_domain            = (known after apply)
      + certificate_not_after         = (known after apply)
      + certificate_p12               = (sensitive value)
      + certificate_p12_password      = (sensitive value)
      + certificate_pem               = (known after apply)
      + certificate_url               = (known after apply)
      + common_name                   = "admin.sample.logotter.co.uk."
      + disable_complete_propagation  = false
      + id                            = (known after apply)
      + issuer_pem                    = (known after apply)
      + key_type                      = "2048"
      + min_days_remaining            = 30
      + must_staple                   = false
      + pre_check_delay               = 0
      + private_key_pem               = (sensitive value)
      + revoke_certificate_on_destroy = true

      + dns_challenge {
          + config   = (sensitive value)
          + provider = "azuredns"
        }
    }

  # acme_certificate.api will be created
  + resource "acme_certificate" "api" {
      + account_key_pem               = (sensitive value)
      + cert_timeout                  = 30
      + certificate_domain            = (known after apply)
      + certificate_not_after         = (known after apply)
      + certificate_p12               = (sensitive value)
      + certificate_p12_password      = (sensitive value)
      + certificate_pem               = (known after apply)
      + certificate_url               = (known after apply)
      + common_name                   = "api.sample.logotter.co.uk."
      + disable_complete_propagation  = false
      + id                            = (known after apply)
      + issuer_pem                    = (known after apply)
      + key_type                      = "2048"
      + min_days_remaining            = 30
      + must_staple                   = false
      + pre_check_delay               = 0
      + private_key_pem               = (sensitive value)
      + revoke_certificate_on_destroy = true

      + dns_challenge {
          + config   = (sensitive value)
          + provider = "azuredns"
        }
    }

  # acme_certificate.certificate will be destroyed
  # (because acme_certificate.certificate is not in configuration)
  - resource "acme_certificate" "certificate" {
      - account_key_pem               = (sensitive value) -> null
      - cert_timeout                  = 30 -> null
      - certificate_domain            = "*.sample.logotter.co.uk" -> null
      - certificate_not_after         = "2024-07-19T08:40:57Z" -> null
      - certificate_p12               = (sensitive value) -> null
      - certificate_p12_password      = (sensitive value) -> null
      - certificate_pem               = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIFETCCA/mgAwIBAgISBI2n5SulFxv94m8xMJDmHu9wMA0GCSqGSIb3DQEBCwUA
            MDIxCzAJBgNVBAYTAlVTMRYwFAYDVQQKEw1MZXQncyBFbmNyeXB0MQswCQYDVQQD
            EwJSMzAeFw0yNDA0MjAwODQwNThaFw0yNDA3MTkwODQwNTdaMCIxIDAeBgNVBAMM
            Fyouc2FtcGxlLmxvZ290dGVyLmNvLnVrMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8A
            MIIBCgKCAQEAuOxEvTJ9WF4+BlHVTKm1ziy/ltW5loTFqc1S+wHBoul23KXtVtYs
            AjazD/OsOl/ee6lH/gA2PIzMUIbxqQufOs6LXqmrYgJzechHowtNFCm8oxyZ3zf8
            JTqHYBDpiIsQFGeZ7rEzvYDTOVka8N+2zFucCncmFoJPC34Rr467yuuSzeipsiOu
            VLPwBnU6AnrJejJhRCCu4J0hgB/1Ae6FKxoi4XH6RxjWmsI4oRz7u9LTgr0uZVE6
            FRAZf6djpQWzu5QOp+RGQIIrlNzccfRQA3WTAa+BkOPfAaX25QRSdmNHJTHOzMfo
            HfgnPZbEm23yJ9cSzcnjhuEUfwX0iFrAMQIDAQABo4ICLzCCAiswDgYDVR0PAQH/
            BAQDAgWgMB0GA1UdJQQWMBQGCCsGAQUFBwMBBggrBgEFBQcDAjAMBgNVHRMBAf8E
            AjAAMB0GA1UdDgQWBBQrQfsRs5V47ueZskqKOTZTkqKGxDAfBgNVHSMEGDAWgBQU
            LrMXt1hWy65QCUDmH6+dixTCxjBVBggrBgEFBQcBAQRJMEcwIQYIKwYBBQUHMAGG
            FWh0dHA6Ly9yMy5vLmxlbmNyLm9yZzAiBggrBgEFBQcwAoYWaHR0cDovL3IzLmku
            bGVuY3Iub3JnLzA5BgNVHREEMjAwghcqLnNhbXBsZS5sb2dvdHRlci5jby51a4IV
            c2FtcGxlLmxvZ290dGVyLmNvLnVrMBMGA1UdIAQMMAowCAYGZ4EMAQIBMIIBAwYK
            KwYBBAHWeQIEAgSB9ASB8QDvAHUAdv+IPwq2+5VRwmHM9Ye6NLSkzbsp3GhCCp/m
            Z0xaOnQAAAGO+uFkawAABAMARjBEAiAeMVCpyUl33XNoTcGzQmUXo0A5l02jXAkB
            agSiwbwG1AIgHF9eitd3CaFIl4nj44LVL0X0JhKueNI97CRu8PeLje8AdgDf4Vbr
            qgWvtZwPhnGNqMAyTq5W2W6n9aVqAdHBO75SXAAAAY764WUAAAAEAwBHMEUCIQDZ
            MWJPPktvOhdCqDC2o5hol+j9utjISUeZ6CBp12k1bwIgTX3DrW5WbHNfnmYY9ek2
            b51BbZZlkk+N5e0NGO6eY3IwDQYJKoZIhvcNAQELBQADggEBACD/u+l/CV66slgB
            SPUeXrFOT9iYdHFjMx27UzPTsRXvlYcqMkHI/2xJOyYEWSZ3NEWEyhI5xNQs04sI
            sCf57FnVraF/KME+KCd/o/0c21oY2goBDKRPkWkvV0PH8TkfN6PRreXd+qxP4bNC
            h7DOz2YFqlg42YZHvBJ8IboIJ1z7pmSB8M4o38F7+PTGMqK9gso5jesj46/+hse6
            2Etbg9A5mHvkLB9AVWNVf0fNCUwOFb6BbGem7GXYQcArfQT32U/YfR742KxB7UK/
            DgpHNVz3enL73kNQ9JOSca4/eajqEFlMt+ALVvi8WON72+2LyCAlw9GxSY3+9Xfs
            BltCJbo=
            -----END CERTIFICATE-----
        EOT -> null
      - certificate_url               = "https://acme-v02.api.letsencrypt.org/acme/cert/048da7e52ba5171bfde26f313090e61eef70" -> null
      - common_name                   = "*.sample.logotter.co.uk" -> null
      - disable_complete_propagation  = false -> null
      - id                            = "718bdd2a-022e-6821-d906-d58d75aff882" -> null
      - issuer_pem                    = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIFFjCCAv6gAwIBAgIRAJErCErPDBinU/bWLiWnX1owDQYJKoZIhvcNAQELBQAw
            TzELMAkGA1UEBhMCVVMxKTAnBgNVBAoTIEludGVybmV0IFNlY3VyaXR5IFJlc2Vh
            cmNoIEdyb3VwMRUwEwYDVQQDEwxJU1JHIFJvb3QgWDEwHhcNMjAwOTA0MDAwMDAw
            WhcNMjUwOTE1MTYwMDAwWjAyMQswCQYDVQQGEwJVUzEWMBQGA1UEChMNTGV0J3Mg
            RW5jcnlwdDELMAkGA1UEAxMCUjMwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEK
            AoIBAQC7AhUozPaglNMPEuyNVZLD+ILxmaZ6QoinXSaqtSu5xUyxr45r+XXIo9cP
            R5QUVTVXjJ6oojkZ9YI8QqlObvU7wy7bjcCwXPNZOOftz2nwWgsbvsCUJCWH+jdx
            sxPnHKzhm+/b5DtFUkWWqcFTzjTIUu61ru2P3mBw4qVUq7ZtDpelQDRrK9O8Zutm
            NHz6a4uPVymZ+DAXXbpyb/uBxa3Shlg9F8fnCbvxK/eG3MHacV3URuPMrSXBiLxg
            Z3Vms/EY96Jc5lP/Ooi2R6X/ExjqmAl3P51T+c8B5fWmcBcUr2Ok/5mzk53cU6cG
            /kiFHaFpriV1uxPMUgP17VGhi9sVAgMBAAGjggEIMIIBBDAOBgNVHQ8BAf8EBAMC
            AYYwHQYDVR0lBBYwFAYIKwYBBQUHAwIGCCsGAQUFBwMBMBIGA1UdEwEB/wQIMAYB
            Af8CAQAwHQYDVR0OBBYEFBQusxe3WFbLrlAJQOYfr52LFMLGMB8GA1UdIwQYMBaA
            FHm0WeZ7tuXkAXOACIjIGlj26ZtuMDIGCCsGAQUFBwEBBCYwJDAiBggrBgEFBQcw
            AoYWaHR0cDovL3gxLmkubGVuY3Iub3JnLzAnBgNVHR8EIDAeMBygGqAYhhZodHRw
            Oi8veDEuYy5sZW5jci5vcmcvMCIGA1UdIAQbMBkwCAYGZ4EMAQIBMA0GCysGAQQB
            gt8TAQEBMA0GCSqGSIb3DQEBCwUAA4ICAQCFyk5HPqP3hUSFvNVneLKYY611TR6W
            PTNlclQtgaDqw+34IL9fzLdwALduO/ZelN7kIJ+m74uyA+eitRY8kc607TkC53wl
            ikfmZW4/RvTZ8M6UK+5UzhK8jCdLuMGYL6KvzXGRSgi3yLgjewQtCPkIVz6D2QQz
            CkcheAmCJ8MqyJu5zlzyZMjAvnnAT45tRAxekrsu94sQ4egdRCnbWSDtY7kh+BIm
            lJNXoB1lBMEKIq4QDUOXoRgffuDghje1WrG9ML+Hbisq/yFOGwXD9RiX8F6sw6W4
            avAuvDszue5L3sz85K+EC4Y/wFVDNvZo4TYXao6Z0f+lQKc0t8DQYzk1OXVu8rp2
            yJMC6alLbBfODALZvYH7n7do1AZls4I9d1P4jnkDrQoxB3UqQ9hVl3LEKQ73xF1O
            yK5GhDDX8oVfGKF5u+decIsH4YaTw7mP3GFxJSqv3+0lUFJoi5Lc5da149p90Ids
            hCExroL1+7mryIkXPeFM5TgO9r0rvZaBFOvV2z0gp35Z0+L4WPlbuEjN/lxPFin+
            HlUjr8gRsI3qfJOQFy/9rKIJR0Y/8Omwt/8oTWgy1mdeHmmjk7j1nYsvC9JSQ6Zv
            MldlTTKB3zhThV1+XWYp6rjd5JW1zbVWEkLNxE7GJThEUG3szgBVGP7pSWTUTsqX
            nLRbwHOoq7hHwg==
            -----END CERTIFICATE-----
        EOT -> null
      - key_type                      = "2048" -> null
      - min_days_remaining            = 30 -> null
      - must_staple                   = false -> null
      - pre_check_delay               = 0 -> null
      - private_key_pem               = (sensitive value) -> null
      - revoke_certificate_on_destroy = true -> null
      - subject_alternative_names     = [
          - "sample.logotter.co.uk",
        ] -> null

      - dns_challenge {
          - config   = (sensitive value) -> null
          - provider = "azuredns" -> null
        }
    }

  # acme_certificate.root will be created
  + resource "acme_certificate" "root" {
      + account_key_pem               = (sensitive value)
      + cert_timeout                  = 30
      + certificate_domain            = (known after apply)
      + certificate_not_after         = (known after apply)
      + certificate_p12               = (sensitive value)
      + certificate_p12_password      = (sensitive value)
      + certificate_pem               = (known after apply)
      + certificate_url               = (known after apply)
      + common_name                   = "sample.logotter.co.uk."
      + disable_complete_propagation  = false
      + id                            = (known after apply)
      + issuer_pem                    = (known after apply)
      + key_type                      = "2048"
      + min_days_remaining            = 30
      + must_staple                   = false
      + pre_check_delay               = 0
      + private_key_pem               = (sensitive value)
      + revoke_certificate_on_destroy = true

      + dns_challenge {
          + config   = (sensitive value)
          + provider = "azuredns"
        }
    }

  # azurerm_container_app.customer-api will be updated in-place
  ~ resource "azurerm_container_app" "customer-api" {
        id                            = "/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/customer-api"
        name                          = "customer-api"
        tags                          = {}
        # (9 unchanged attributes hidden)

      ~ template {
            # (3 unchanged attributes hidden)

          ~ container {
              ~ image             = "ghcr.io/logotter/customer-api:0.1.87" -> "ghcr.io/logotter/customer-api:"
                name              = "customer-api"
                # (5 unchanged attributes hidden)

                # (6 unchanged blocks hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_container_app.customer-worker will be updated in-place
  ~ resource "azurerm_container_app" "customer-worker" {
        id                            = "/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/customer-worker"
        name                          = "customer-worker"
        tags                          = {}
        # (9 unchanged attributes hidden)

      ~ template {
            # (3 unchanged attributes hidden)

          ~ container {
              ~ image             = "ghcr.io/logotter/customer-worker:0.1.87" -> "ghcr.io/logotter/customer-worker:"
                name              = "customer-worker"
                # (5 unchanged attributes hidden)

                # (4 unchanged blocks hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_container_app.hub will be updated in-place
  ~ resource "azurerm_container_app" "hub" {
        id                            = "/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/hub"
        name                          = "hub"
        tags                          = {}
        # (9 unchanged attributes hidden)

      ~ template {
            # (3 unchanged attributes hidden)

          ~ container {
              ~ image             = "ghcr.io/logotter/hub:0.1.87" -> "ghcr.io/logotter/hub:"
                name              = "hub"
                # (5 unchanged attributes hidden)

                # (6 unchanged blocks hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_container_app.ingress will be updated in-place
  ~ resource "azurerm_container_app" "ingress" {
        id                            = "/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/ingress"
        name                          = "ingress"
        tags                          = {}
        # (9 unchanged attributes hidden)

      ~ template {
            # (3 unchanged attributes hidden)

          ~ container {
              ~ image             = "ghcr.io/logotter/ingress:0.1.87" -> "ghcr.io/logotter/ingress:"
                name              = "hub"
                # (5 unchanged attributes hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_container_app_custom_domain.admin must be replaced
-/+ resource "azurerm_container_app_custom_domain" "admin" {
      ~ container_app_environment_certificate_id = "/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/managedEnvironments/log-otter-sample-container-app-environment/certificates/wildcard-certificate" # forces replacement -> (known after apply) # forces replacement
      ~ id                                       = "/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/ingress/customDomainName/admin.sample.logotter.co.uk." -> (known after apply)
        name                                     = "admin.sample.logotter.co.uk."
        # (2 unchanged attributes hidden)
    }

  # azurerm_container_app_custom_domain.api must be replaced
-/+ resource "azurerm_container_app_custom_domain" "api" {
      ~ container_app_environment_certificate_id = "/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/managedEnvironments/log-otter-sample-container-app-environment/certificates/wildcard-certificate" # forces replacement -> (known after apply) # forces replacement
      ~ id                                       = "/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/ingress/customDomainName/api.sample.logotter.co.uk." -> (known after apply)
        name                                     = "api.sample.logotter.co.uk."
        # (2 unchanged attributes hidden)
    }

  # azurerm_container_app_custom_domain.root must be replaced
-/+ resource "azurerm_container_app_custom_domain" "root" {
      ~ container_app_environment_certificate_id = "/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/managedEnvironments/log-otter-sample-container-app-environment/certificates/wildcard-certificate" # forces replacement -> (known after apply) # forces replacement
      ~ id                                       = "/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/ingress/customDomainName/sample.logotter.co.uk." -> (known after apply)
        name                                     = "sample.logotter.co.uk."
        # (2 unchanged attributes hidden)
    }

  # azurerm_container_app_environment_certificate.admin will be created
  + resource "azurerm_container_app_environment_certificate" "admin" {
      + certificate_blob_base64      = (sensitive value)
      + certificate_password         = (sensitive value)
      + container_app_environment_id = "/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/managedEnvironments/log-otter-sample-container-app-environment"
      + expiration_date              = (known after apply)
      + id                           = (known after apply)
      + issue_date                   = (known after apply)
      + issuer                       = (known after apply)
      + name                         = "admin-certificate"
      + subject_name                 = (known after apply)
      + thumbprint                   = (known after apply)
    }

  # azurerm_container_app_environment_certificate.api will be created
  + resource "azurerm_container_app_environment_certificate" "api" {
      + certificate_blob_base64      = (sensitive value)
      + certificate_password         = (sensitive value)
      + container_app_environment_id = "/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/managedEnvironments/log-otter-sample-container-app-environment"
      + expiration_date              = (known after apply)
      + id                           = (known after apply)
      + issue_date                   = (known after apply)
      + issuer                       = (known after apply)
      + name                         = "api-certificate"
      + subject_name                 = (known after apply)
      + thumbprint                   = (known after apply)
    }

  # azurerm_container_app_environment_certificate.container-app-certificate will be destroyed
  # (because azurerm_container_app_environment_certificate.container-app-certificate is not in configuration)
  - resource "azurerm_container_app_environment_certificate" "container-app-certificate" {
      - certificate_blob_base64      = (sensitive value) -> null
      - certificate_password         = (sensitive value) -> null
      - container_app_environment_id = "/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/managedEnvironments/log-otter-sample-container-app-environment" -> null
      - expiration_date              = "2024-07-19T08:40:57" -> null
      - id                           = "/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/managedEnvironments/log-otter-sample-container-app-environment/certificates/wildcard-certificate" -> null
      - issue_date                   = "2024-04-20T08:40:58" -> null
      - issuer                       = "CN=R3, O=Let's Encrypt, C=US" -> null
      - name                         = "wildcard-certificate" -> null
      - subject_name                 = "CN=*.sample.logotter.co.uk" -> null
      - tags                         = {} -> null
      - thumbprint                   = "4C4B9D7F9988732C25306786B34693AC6B8E4323" -> null
    }

  # azurerm_container_app_environment_certificate.root will be created
  + resource "azurerm_container_app_environment_certificate" "root" {
      + certificate_blob_base64      = (sensitive value)
      + certificate_password         = (sensitive value)
      + container_app_environment_id = "/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/managedEnvironments/log-otter-sample-container-app-environment"
      + expiration_date              = (known after apply)
      + id                           = (known after apply)
      + issue_date                   = (known after apply)
      + issuer                       = (known after apply)
      + name                         = "root-certificate"
      + subject_name                 = (known after apply)
      + thumbprint                   = (known after apply)
    }

Plan: 9 to add, 4 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher:* @AButler
*Last Updated:* `2024-04-21T13:57:23.438Z`